app/controllers/heroes_controller.rb

SELECT "heroes".* FROM "heroes"
---
  def index
    heroes = Heroe.all

SELECT "heroes".* FROM "heroes" WHERE "heroes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_hero
    Heroe.find(params[:id])