app/controllers/hero_powers_controller.rb

SELECT "hero_powers".* FROM "hero_powers"
---
  def index
      render json: HeroPower.all, status: :ok

INSERT INTO "hero_powers" ("strength", "power_id", "heroe_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["strength", "Strong"], ["power_id", 2], ["heroe_id", 1], ["created_at", "2022-10-11 21:29:57.329648"], ["updated_at", "2022-10-11 21:29:57.329648"]]
SELECT "powers".* FROM "powers" WHERE "powers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "heroes".* FROM "heroes" WHERE "heroes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    hero_power = HeroPower.create!(hero_power_params)
    hero = Heroe.find(hero_power.heroe_id)