app/controllers/powers_controller.rb

  def index
    powers = Power.all
---
SELECT "powers".* FROM "powers"

  def update
    power = find_power
    power.update!(power_params)
---
UPDATE "powers" SET "description" = $1, "updated_at" = $2 WHERE "powers"."id" = $3  [["description", "an updated description about the movie"], ["updated_at", "2022-10-11 20:38:52.499971"], ["id", 1]]

  def find_power
    Power.find(params[:id])
---
SELECT "powers".* FROM "powers" WHERE "powers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]